Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: This is a podified version of what used to be on the above-mentioned web page, podified by Jarkko Hietaniemi 2001-Jan-01.
es_es: Esta es una versión I<podificada> de lo que solía estar en la anterior página web anteriormente mencionada, I<podificada> por Jarkko Hietaniemi 2001-enero-01.

source: will place into $count the number of digit groups found in $string.
es_es: pondrá en $cuenta el número de grupos de dígitos que se encuentren en $cadena.

source: sub match {
es_es: sub coincidencia {

source: (Long doubles are available only if your system supports long
es_es: (Los dobles-largos están disponibles solo si su sistema soporta valores largos

source: say "NEW PARAGRAPH";
es_es: say "NUEVO PÁRRAFO";

source: =head1 SYNOPSIS
es_es: =head1 SINOPSIS

source: In particular, all the modifiers execpt C</o> are further explained in L<perlre/Modifiers>.
es_es: En particular, todos los modificadores, excepto C</o> se explican en L<perlre/Modificadores>.

# 'aaabaaab' =~ /a+b?(*SKIP)(?{print "$& "; $count++})(*FAIL)/;
source: 'aaabaaab' =~ /a+b?(*SKIP)(?{print "$&\n"; $count++})(*FAIL)/;
es_es: 'aaabaaab' =~ /a+b?(*SKIP)(?{print "$&\n"; $contador++})(*FAIL)/;

source: To support the bootstrapping process, F<miniperl> no longer builds with UTF-8 support in the regexp engine.
es_es: Para mejorar el proceso de arranque, F<miniperl> ya no se compila con soporte UTF-8 en el motor de expresiones regulares.

source: It can be used to go almost anywhere else within the dynamic scope, including out of subroutines, but it's usually better to use some other construct such as C<last> or C<die>.
es_es: Puede ser utilizada para ir a casi cualquier sitio que esté dentro del ámbito dinámico, incluyendo fuera de las subrutinas, pero es normalmente mucho mejor otras construcciones como C<last> o C<die>.

source: Assignment is a little bit special in that it uses its left argument to determine the context for the right argument.
es_es: La asignación es un poco especial en el sentido de que utiliza su argumento de la izquierda para determinar el contexto del argumento de la derecha.

source: Rounding in financial applications can have serious implications, and the rounding method used should be specified precisely.
es_es: El redondeo en las aplicaciones financieras puede tener consecuencias graves, y el método de redondeo utilizado debe ser descrito con precisión.

source: Any positive flags (except C<"d">) may follow the caret, so
es_es: Cualquier bandera positiva (excepto C<"d">) pueden seguir al circunflejo, por lo que

source: This may be useful in a my() or local().
es_es: Esto puede ser útil en un my() o local().

source: If the repeat count is C<0>, it's relative to the current position.
es_es: Si el número de repeticiones es C<0>, es relativa a la posición actual.

source: "Content-Length: $byte_count"
es_es: "Content-Length: $numero_bytes"

source: Note that in this release, using a string eval when C<autodie> is in effect can cause the autodie behaviour to leak into the surrounding scope.
es_es: Tenga en cuenta que en esta versión, usando una cadena C<eval>uada cuando C<autodie> está activo puede causar que el comportamiento de autodie se fugue del ámbito actual.

source: These operators are exempt from the "looks like a function rule" described above.
es_es: Estos operadores están exentos de la regla "se parece a una función" descrita anteriormente.

source: produce the output 'h:i: :t:h:e:r:e:!:' and 'hi:there:', respectively, both with an empty trailing field.
es_es: produce la salida 'h:o:l:a: :a:q:u:i:!:' y 'hola:aqui:', respectivamente, ambos con un campo vacío final.

source: A reference is a scalar value and can refer to any other Perl data type.
es_es: Una referencia es un valor escalar que puede apuntar a cualquier tipo de datos de Perl.

source: my @abbr = qw( Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec );
es_es: my @abbr = qw( Ene Feb Mar Abr May Jun Jul Ago Sep Oct Nov Dic );

source: If you want to get at a slice (part of a row) in a multidimensional array, you're going to have to do some fancy subscripting.
es_es: Si desea obtener una porción (parte de una fila) en una matriz multidimensional, va a tener que hacer algunos juegos malabares con los subíndices.

source: perldiag Perl diagnostic messages
es_es: perldiag Mensajes de diagnóstico

# print "got $a ";
source: print "got $a\n";
es_es: print "tengo $a\n";

source: =item die LIST X<die> X<throw> X<exception> X<raise> X<$@> X<abort>
es_es: =item die LISTA X<die> X<throw> X<exception> X<raise> X<$@> X<abort> X<excepción> X<levantar> X<abortar> X<descartar>

source: The suffix is no longer stripped if it is identical to the remaining characters in the name, again for consistency with the shell utility.
es_es: El sufijo ya no es eliminado si es idéntico al resto de los caracteres en el nombre, una vez más para mantener la coherencia con la utilidad del shell.

source: If not, they always return $timeleft equal to the supplied $timeout.
es_es: Si no, siempre devuelven $tiempo_restante igual a $tiempo_espera indicado.

source: (Bugs reports about microperl without fixes/patches are equivalent to wishlist requests - they won't be discarded, but they likely won't get worked on either, unless they chance to coincide with someone's personal itch)
es_es: (Informes de errores acerca de microperl sin correcciones/parches son equivalentes a las peticiones - no van a ser desechados, pero probablemente no se trabajará en ellos, a menos que coincida oportunamente con una comezón personal de algún voluntario)

source: =head2 Threading
es_es: =head2 Multihilos

source: Threads Will Be Removed
es_es: I<Threads> serán eliminados

source: Even if these conditions are met, be warned that unlinking a directory can inflict damage on your filesystem.
es_es: Incluso si se cumplen estas condiciones, se advierte que desvincular un directorio puede causar daños a su sistema de archivos.

source: for (values %hash) { s/foo/bar/g } # modifies %hash values
es_es: for (values %hash) { s/foo/bar/g } # modifica los valores de %hash

source: This means that programmers need new habits.
es_es: Esto significa que los programadores deben adquirir nuevas costumbres.

source: It extends the recommendations found in L<perlstyle> , which should be considered required reading before reading this document.
es_es: Extiende las recomendaciones que se encuentran en L<perlstyle>, que debe ser considerado de lectura obligatoria antes de leer este documento.

source: In scalar context, returns the number of fields found.
es_es: En contexto escalar, devuelve el número de campos que se han encontrado.

source: Note that argument processing varies depending on the number of arguments.
es_es: Tenga en cuenta que el tratamiento de los argumentos varía en función del número de argumentos.

source: You can also insert hooks into the import facility by putting Perl code directly into the @INC array.
es_es: También puede insertar enganches en la facilidad C<import> poniendo código Perl directamente en el array @INC.

source: $year = sprintf("%02d", $year % 100);
es_es: $anno = sprintf("%02d", $anno % 100);

source: local *Here::blue = \$There::green;
es_es: local *Aqui::azul = \$Ahi::verde;

source: Returns the character represented by that NUMBER in the character set.
es_es: Devuelve el carácter representado por NÚMERO en el conjunto de caracteres.

source: perlsource Guide to the Perl source tree
es_es: perlsource Guía al árbol de código fuente de Perl

source: my $color = substr $s, 4, 5; # black
es_es: my $color = substr $s, 8, 5; # negro

source: right **
es_es: derecha **

source: =head2 Closures, eval and lexicals
es_es: =head2 Clausuras, eval y léxicas

source: In addition to fields allowed in pack(), you may prefix a field with a %<number> to indicate that you want a <number>-bit checksum of the items instead of the items themselves.
es_es: Además de los campos permitidos en pack(), puede usar un prefijo de un campo con un %<número> para indicar que desea una suma de control a nivel de bit de los elementos en lugar de los propios elementos.

source: =head3 Encoding
es_es: =head3 Codificación

source: Perl 6 is not scheduled for release yet, and Perl 5 will still be supported for quite awhile after its release.
es_es: El lanzamiento de Perl 6 aún no está programado, pero recuerde que Perl 5 seguirá vivo mucho tiempo después de que esto ocurra.

source: Unicode has many more characters than that, so you need a method to make these accessible.
es_es: En Unicode hay muchos más caracteres, por lo que necesitamos una forma de hacerlos accesibles.

source: Note that some system calls I<can> legitimately return C<-1>.
es_es: Tenga en cuenta que algunas llamadas al sistema I<pueden> legalmente devolver C<-1>.

source: Package the module using "make dist"
es_es: Empaquete el módulo con "make dist"

source: This is a new warning, produced in situations like the following one:
es_es: Esta es una nueva advertencia, que se produce en situaciones como la siguiente:

source: \H [3] Not horizontal whitespace
es_es: \H [3] No espacio en blanco horizontal

source: =item open FILEHANDLE,EXPR X<open> X<pipe> X<file, open> X<fopen>
es_es: =item open IDENTIFICADOR_ARCHIVO,EXPR X<open> X<pipe> X<file, open> X<fopen> X<archivo, open>

source: This also means that if you want real whitespace or C<#> characters in the pattern (outside a character class, where they are unaffected by C</x>), then you'll either have to escape them (using backslashes or C<\Q...\E>) or encode them using octal, hex, or C<\N{}> escapes.
es_es: Esto también significa que si quiere un espacio en blanco real o caracteres C<#> en el patrón (excepto en una clase de caracteres, donde no les afecta C</x>), entonces tendrá que escaparlos (usando barras invertidas o C<\Q...\E>) o codificarlas usando octal, hex, o secuencias de escape C<\N{}>.

source: The following is a list of expected failures with the patch number of the fix where that is known:
es_es: La siguiente es una lista de los errores esperados con el número de revisión de la corrección en el que se conocen:

source: A zero-width negative look-behind assertion.
es_es: Una aserción antecedente negativa de ancho cero.

source: Perl should build cleanly on Stratus VOS once more.
es_es: Perl debe compilarse limpiamente en Stratus VOS, una vez más.

source: That means that if you don't use binmode() on these systems, C<\cM\cJ> sequences on disk will be converted to C<\n> on input, and any C<\n> in your program will be converted back to C<\cM\cJ> on output.
es_es: Esto significa que, si no usa binmode() en estos sistemas, las secuencias C<\cM\cJ> en disco serán convertidas a C<\n> en la entrada y cualquier C<\n> en tu programa será convertido de nuevo en C<\cM\cJ> en la salida.

source: If this file is found, it will be loaded in place of any potentially existing file ending in a F<.pm> extension.
es_es: Si se encuentra este archivo, se cargará en lugar de cualquier archivo existente que termine en la extensión F<. pm>.

source: print "Basset hounds got long ears" if length $ear >= 10;
es_es: print "El perro de caza Basset tiene largas orejas" if length $oreja >= 10;

source: \k<name> [5] Named backreference
es_es: \k<name> [5] Contrareferencia nominal

source: %X like %x, but using upper-case letters
es_es: %X como %x, pero usando mayúsculas

source: This document describes differences between the 5.8.0 release and the 5.8.1 release.
es_es: Este documento describe las diferencias entre la versión 5.8.0 y la versión 5.8.1.

source: will transliterate any A to X.
es_es: transliterará cualquier A a X.

source: If the C<(*ACCEPT)> is inside of capturing groups then the groups are marked as ended at the point at which the C<(*ACCEPT)> was encountered.
es_es: Si el C<(*ACCEPT)> se encuentra dentro de grupos de captura entonces los grupos son marcados para terminar en el lugar en que se encontró el C<(*ACCEPT)>.

source: When the match runs, the first part of the regular expression (C<\b(foo)>) finds a possible match right at the beginning of the string, and loads up $1 with "Foo".
es_es: Cuando la coincidencia se ejecuta, la primera parte de la expresión regular (C<\b(come)>) encuentra una posible coincidencia al principio de la cadena, y carga $1 con "Come".

source: This function tells the thingy referenced by REF that it is now an object in the CLASSNAME package.
es_es: Esta función dice que la cosa referenciada por REF es ahora un objeto del paquete NOMBRECLASE (I<bless> es bendición en inglés, que se podría traducir mejor por bautizar, en el sentido de 'dar un nombre' al objeto).

source: At the cost of a little more overhead, you can do this by using the /m modifier on the pattern match operator.
es_es: A costa de una ligera sobrecarga, puede hacer esto usando el modificador /m en el patrón del operador de coincidencia.

source: $cnt = chown $uid, $gid, 'foo', 'bar';
es_es: $num = chown $uid, $gid, 'foo', 'bar';

source: When used on a hash element, it tells you whether the value is defined, not whether the key exists in the hash.
es_es: Cuando se usa con un elemento de un hash, le indica si el valor está definido, no si la clave existe en el hash.

source: See L<perl590delta>, L<perl591delta>, L<perl592delta> and L<perl593delta> for the differences between 5.8.0 and 5.9.3.
es_es: Vea L<perl590delta>, L<perl591delta>, L<perl592delta> y L<perl593delta> para consultar las diferencias entre 5.8.0 y 5.9.3.

source: Most other approaches are doomed to failure.
es_es: La probabilidad de éxito de las demás opciones es escasa.

source: Use of the constants is also more portable than relying on 0, 1, and 2.
es_es: El uso de las constantes también es más portátil que confiar en 0, 1 y 2.

source: These are scripts which will check the source things like ANSI C violations, POD encoding issues, etc.
es_es: Scripts que detectarán en el código fuente cosas como infracciones de ANSI C, problemas de codificación de POD, etc.

source: or die "Can't open mailbox: $!";
es_es: or die "No puedo abrir el buzón: $!";

source: =head2 Platform-Specific
es_es: =head2 Información específica de plataformas

source: [[:...:]] [2] Match a character according to the rules of the POSIX character class "..." within the outer bracketed character class.
es_es: [[:...:]] [2] Busca un carácter de acuerdo a las reglas de la clase carácter POSIX "..." dentro de la clase carácter más exterior.

source: For example, C<chr(65)> is C<"A"> in either ASCII or Unicode, and chr(0x263a) is a Unicode smiley face.
es_es: Por ejemplo, C<chr(65)> es C<"A"> tanto en ASCII como en Unicode, y chr(0x263a) es una cara sonriente en Unicode.

source: The number of characters is no longer known, because characters only exist in text strings.
es_es: Ya no se sabe cuál es el número de caracteres, puesto que los caracteres solo existen en las cadenas de texto.

source: Do not consider C<getlogin> for authentication: it is not as secure as C<getpwuid>.
es_es: No considere usar C<getlogin> para autenticación: no es tan seguro como C<getpwuid>.

source: Shadow password files are supported only if your vendor has implemented them in the intuitive fashion that calling the regular C library routines gets the shadow versions if you're running under privilege or if there exists the shadow(3) functions as found in System V (this includes Solaris and Linux).
es_es: Archivos de contraseñas shadow sólo están soportados si el proveedor los ha implementado con la intuitiva moda de que llamando a las rutinas regulares de la biblioteca C se obtienen las versiones shadow si está corriendo con bajos privilegios o si existe la función shadow(3) tal como se encuentra en System V (esto incluye Solaris y Linux).

source: This is called synonymously its ordinal, code position, or code point.
es_es: Esto se conoce, de forma similar, como su valor ordinal, posición del código, o punto de código.

source: In list context, returns a list of lines (however you've defined lines with C<$/> or C<$INPUT_RECORD_SEPARATOR>).
es_es: En contexto lista, devuelve una lista de líneas (según haya definido lo que son líneas con C<$/> o C<$INPUT_RECORD_SEPARATOR>).

source: To decode, you have to know what encoding was used during the encoding phase.
es_es: Para descodificar necesita saber la codificación que se utilizó al codificar.

source: perlinterp Overview of the Perl intepreter source and how it works
es_es: perlinterp Visión general al código fuente del intérprete Perl, y cómo funciona

source: The C<roffitall> utility is not installed on your system but lives in the F<pod/> directory of your Perl source kit; it converts all the documentation from the distribution to F<*roff> format, and produces a typeset PostScript or text file of the whole lot.
es_es: La utilidad C<roffitall> no se instala en el sistema, pero puede encontrarla en el directorio F<pod/> del kit de código fuente de Perl. Esta utilidad convierte toda la documentación de la distribución al formato F<*roff> y a partir de esto genera código fuente PostScript o un archivo de texto.

source: Note that functions such as C<keys> and C<values> may return huge lists when used on large DBM files.
es_es: Note que las funciones como C<keys> y C<values> pueden devolver largas listas cuando se usan con archivos DBM grandes.

source: This is usually 32766 on the most common platforms.
es_es: Éste es, normalmente, 32766, en la mayoría de las plataformas.

source: Consider giving away your code.
es_es: Considere compartir su código.

source: , => {3,7} repeat in range /o cmpl pat.
es_es: , => {3,7} repeticiones /o compilar patrón

source: scalar => { description => "single item", sigil => '$', },
es_es: scalar => { descripcion => "un solo valor", sigilo => '$', },

source: If you think this
es_es: Si piensa que esto

source: This now correctly produces the run-time error C<Can't use string as a SCALAR ref while "strict refs" in use>.
es_es: Esto ahora produce correctamente el error en tiempo de ejecución C<Can't use string as a SCALAR ref while "strict refs" in use>.

source: This should give a few percent speed increase, and eliminates almost all of the speed penalty caused by the introduction of "safe signals" in 5.8.0.
es_es: Esto debería dar un pequeño porcentaje de aumento de velocidad, y elimina casi la totalidad de la pérdida de velocidad causada por la introducción de las "señales de seguridad" en la 5.8.0.

source: This means that alternatives are not necessarily greedy.
es_es: Esto significa que las alternativas no son necesariamente codiciosas.

source: =item C<(?^aluimsx:pattern)> X<(?^:)>
es_es: =item C<(?^aluimsx:patrón)> X<(?^:)>

source: The only operators with lower precedence are the logical operators "and", "or", and "not", which may be used to evaluate calls to list operators without the need for extra parentheses:
es_es: Los únicos operadores con menor prioridad son los operadores lógicos "and", "or", y "no", que pueden ser utilizados para evaluar las llamadas a los operadores de lista sin necesidad de paréntesis adicionales:

source: =item my EXPR : ATTRS
es_es: =item my EXPR : ATRIBUTOS

source: perl -d:DProf program.pl
es_es: perl -d:DProf programa.pl

source: Earlier versions of mod_perl 2.x do not work with the randomised hashes.
es_es: Las versiones anteriores de mod_perl 2.x no funcionan con la función de aleatorización de los hashes.

source: C<$isdst> is true if the specified time occurs during Daylight Saving Time, false otherwise.
es_es: C<$isdst> es verdadero si el tiempo especificado se produce durante el horario de verano; en caso contrario, falso.

source: ISBN 978-0-596-10206-7 [1st edition July 2007]
es_es: ISBN 978-0-596-10206-7 [1ª edición - Julio de 2007]

source: 8 atime last access time in seconds since the epoch
es_es: 8 atime tiempo último acceso, en segundos, desde el epoch

source: =head2 Switch and Smart Match operator
es_es: =head2 El operador Switch y el emparejamiento inteligente

source: print $animals[0]; # prints "camel"
es_es: print $animales[0]; # imprime "camello" en pantalla

source: APIs obsoleted in Perl 5.8.0, like sv_2pv, sv_catpvn, sv_catsv, sv_setsv, are again available.
es_es: API obsoleta en Perl 5.8.0, como sv_2pv, sv_catpvn, sv_catsv, sv_setsv, están de nuevo disponibles.

source: =head2 C<$,> flexibility
es_es: =head2 Flexibilidad de C<$,>

source: On error, C<select> behaves like select(2): it returns -1 and sets C<$!>.
es_es: En caso de error, C<select> se comporta como select(2): devuelve -1 y actualiza C<$!>.

source: =head2 Module auxiliary files
es_es: =head2 Archivos auxiliares de los módulos

source: This document is written in pod format hence there are punctuation characters in odd places.
es_es: Este documento está escrito en formato pod, por lo que hay caracteres de puntuación en lugares extraños.

source: # File types.
es_es: # Tipos de archivo.

source: In general, this is a big win except in pathological cases.
es_es: En general, esto es un gran ahorro, salvo en casos patológicos.

source: my ($X, $Y, $POINTS) = @_;
es_es: my ($X, $Y, $PUNTOS) = @_;

source: For instance, the syntax for a block and an anonymous hash reference constructor look the same unless there's something in the braces that give Perl a hint.
es_es: Por ejemplo, la sintaxis de un bloque y un constructor de referencia a un hash anónimo tienen el mismo aspecto a menos que haya algo dentro de las llaves que le den una pista a Perl.

source: When large amounts of client code will use the software (and should be insulated from changes in its implementation)
es_es: Cuando grandes cantidades de código del cliente utilizará el software (y debe estar aislado de los cambios en su implementación)

source: =item chomp VARIABLE X<chomp> X<INPUT_RECORD_SEPARATOR> X<$/> X<newline> X<eol>
es_es: =item chomp VARIABLE X<chomp> X<INPUT_RECORD_SEPARATOR> X<$/> X<newline> X<eol> X<nueva línea>

source: Prior to 5.14, there were no explicit modifiers, but C</l> was implied for regexes compiled within the scope of C<use locale>, and C</d> was implied otherwise.
es_es: Antes de 5.14, no existían modificadores explícitos, pero C</l> estaba implícito para las expresiones regulares compiladas en el ámbito de C<use locale>, y C</d> era el implícito en caso contrario.

source: The importance of these tests is proportional to the alleged stability of a module.
es_es: La importancia de estas pruebas es proporcional a la supuesta estabilidad de un módulo.

source: $output = `cmd 2>&1`;
es_es: $salida = `comando 2>&1`;

source: my $byte_count = length $binary;
es_es: my $numero_bytes = length $binario;

# ... + one or more /s . includes
source: ... + one or more /s . includes \n
es_es: ... + uno o varios /s . incluye \n

source: = assignment
es_es: = asignación

source: There are a number of issues with regard to case-insensitive matching in Unicode rules.
es_es: Hay una serie de cuestiones con respecto a las coincidencias con las mayúsculas y minúsculas en las reglas Unicode.

source: =item glob EXPR X<glob> X<wildcard> X<filename, expansion> X<expand>
es_es: =item glob EXPR X<glob> X<wildcard> X<filename, expansion> X<expand> X<archivo, expansión> X<comodín> X<expandir>

source: Simply quote all non-"word" characters:
es_es: Escape sencillamente todos los caracteres que no formen parte de una palabra:

source: F<ptar> is a tar-like program, written in pure Perl.
es_es: F<ptar> es un programa tar escrito en código Perl puro.

source: Writing subroutines is easy:
es_es: Es fácil escribir subrutinas:

source: When used in scalar context, the return value generally indicates the success of the operation.
es_es: Cuando se usa en contexto escalar, el valor devuelto, por lo general, indica el éxito de la operación.
